{
    "careers": [
        {
            "id": 1,
            "roleName": "Java Developer",
            "postedDate": "05/15/2020",
            "location": "London",
            "jobType": "Full Time",
            "aboutCompany": "ANANYA IT SERVICES LTD is a rapidly expanding organization based in London.Our aim is to provide high quality business solutions tailored to individual customer requirements. Our work focuses on building in-house UI Design Systems (cross platforms) for growing and well-established companies. We are creating a new Restful API’s, refactoring Legacy code, which will enable our developers to create clear and clean pragmatic codes. We have built a strong engineering foundation for knowledge-sharing with several skill shares, guilds, and open discussions running every month. Our Product & Services Development team is building out new digital platforms at a fast pace, and is now looking for a talented Java Developer to join our growing team and look after our vast client base needs. In addition to working in an exciting industry and in a friendly environment, our company provides each engineer with support for their progression within the company.",
            "jobDescription": [
                "Carrying out development in accordance with the agreed requirements and development standards",
                "Testing of products in accordance with the test strategy to ensure that they are fit for purpose",
                "Assisting the Team Leader in examining packages of work and giving realistic timescales for completion",
                "Completion of work allocated within agreed time, cost and quality criteria and providing progress reports on assigned work as required",
                "Management and control of problems and change within their area of responsibility as requested by the Team Leader, including negotiation with other teams as necessary",
                "Prompt escalation of problems, issues and risks as necessary",
                "Playing an active part in Process improvement, awareness of and compliance with all relevant quality processes and procedures, including completion of all the specified quality records in order to be successful the candidate will be familiar with FMSD strategy and will work to achieve those business objectives."
            ],
            "mandatorySkills": [
                "Successfully manage themselves during the project lifecycle.",
                "Identify and mitigate risks that would impact the failure of the overall project and success.",
                "Effectively engage with multiple stakeholders and vendors on a regular basis.",
                "Must have hands-on Coding experience",
                "Must have worked on 2-3 Java Spring implementations",
                "Good knowledge of Spring Boot, Spring Integration, Spring Data",
                "Excellent analysis skills",
                "Strong and clear communication and presentation skills",
                "Self-motivated and enthusiastic",
                "Knowledge of the Scala programming language and the Akka framework.",
                "Experience as an open-source contributor and/or speaker"
            ],
            "technicalSkill":[
                "Java 11",
                "Spring Boot",
                "MySQL",
                "Oracle /Mongo Database",
                "Linux",
                "SOAP",
                "Restful Web Services",
                "JMS (RabbitMQ & WebSphere)",
                "UI experience",
                "Batch/File Handling",
                "GIT",
                "WebSphere",
                "IBM DMS tool experience"
            ],
            "additionalInfo": [],
            "desiredSkills": [
                "Successful candidates would ideally also demonstrate: <br/>An understanding of Risk Management.",
                "Strong experience in scripting languages, particularly Python Ability to code test tooling in Java Understanding of, and experience in non-functional testing, particularly around performance testing of latency metrics."
            ],
            "qualification": [
                "Educated to at least graduate level (e.g. Bachelor Of Engineering, B-Tech) or equivalent is essential."
            ],
            "salary": "Salary: £33,000 to £35,000 per year",
            "expiredStatus": false
        },
        {
            "id": 2,
            "roleName": "Cyber Security Consultant",
            "postedDate": "12/16/2020",
            "location": "London",
            "jobType": "Full Time",
            "aboutCompany": "ANANYA IT SERVICES LTD is a rapidly expanding organization based in London.Our aim is to provide high quality business solutions tailored to individual customer requirements. Our work focuses on building in-house UI Design Systems (cross platforms) for growing and well-established companies. We are creating a new Restful API’s, refactoring Legacy code, which will enable our developers to create clear and clean pragmatic codes. We have built a strong engineering foundation for knowledge-sharing with several skill shares, guilds, and open discussions running every month. Our Product & Services Development team is building out new digital platforms at a fast pace, and is now looking for a talented Java Developer to join our growing team and look after our vast client base needs. In addition to working in an exciting industry and in a friendly environment, our company provides each engineer with support for their progression within the company.",
            "jobDescription": [
                "The candidate is expected to be able to implement security services independently to deploy security services / products in mega projects that involves many security products and also across different domains (server, storage, applications, network etc).In addition to carrying out implementation, is required to give technical advice’s, recommendations & presentations in order to convince customer to adopt / accept the proposed solution.",
                "In addition to carrying out implementation, is required to give technical advice’s, recommendations & presentations in order to convince customer to adopt / accept the proposed solution."    
            ],
            "mandatorySkills": [],
            "technicalSkill":[
                "CheckPoint firewalls",
                "Palo Alto firewallst",
                "Fortinet firewalls",
                "RSA 2FA solutions",
                "Symantec end-point",
                "McAfee end-point",
                "BeyondTrust privilege access management systems",
                "CyberArk privilege access management systems",
                "Waterfall data diode",
                "QRadar logger / SIEM",
                "Carbon Black end-point",
                "Imperva database firewall",
                "Guardium database firewal",
                "Rapid7 vulnerability management software",
                "Nessus Tenables vulnerability management software"
            ],
            "additionalInfo": [
                "Implementation – can be either new installations or migration from existing system to new system.",
                "Candidate has to validate / evaluate that the solution that was sold to customer and call out discrepancies (if any). Ideally, this candidate should also persuade, sway & influence the customer to accept the new solution.",
                "Often time expected to work with diverse teams (in a matrix project organisation) – server, network & applications teams.",
                "Although this is not a shift job, but when there is a deadline or migration, the candidate needs to work longer hrs. He can claim his time-off eventually.",
                "Working environment varies (in different data centre and in customer’s offices) as per project needs."
            ],
            "desiredSkills": [],
            "qualification": [
                "Educated to at least graduate level (e.g. Bachelor Of Engineering, B-Tech) or equivalent is essential."
            ],
            "salary": "Salary: £27520 per year",
            "expiredStatus": true
        }
    ],
    "location":[
        "London"
    ],
    "jobType":[
        "Full Time",
        "Part Time"
    ],
    "feeds":[
        {
            "feedName": "Over 200,000 more people are at risk of poor mental health this year due to unemployment",
            "postDate": "22/05/2021 13:10:12",
            "feedDescription": "New analysis by the Health Foundation estimates that over 200,000 more people are at risk of poor mental health this year due to unemployment.",
            "reedMoreLink": "https://www.health.org.uk/news-and-comment/news/over-200000-more-people-are-at-risk-of-poor-mental-health"
        },
        {
            "feedName": "1.5 million potential years of life lost to COVID-19 in the UK, with each life cut short by 10 years on average",
            "postDate": "20/05/2021 15:10:12",
            "feedDescription": "New analysis from the Health Foundation reveals the ‘devastating’ scale of loss in the pandemic, with UK response ‘falling short in key areas’.",
            "reedMoreLink": "https://www.health.org.uk/news-and-comment/news/1.5-million-potential-years-of-life-lost-to-covid-19"
        }
    ]
}
