{
    "careers": [
        {
            "id": 1,
            "roleName": "Salesforce CCRM - QA Lead",
            "postedDate": "07/23/2021",
            "location": "London",
            "jobType": "Contract",
            "jobDescription": [
                "The Quality Assurance Team's mission is to drive quality into all software products produced by/or on behalf of Cancer Research UK.  The team is striving to enhance testing service throughout the project lifecycle and ultimately assist Technology in improving the quality of product we deliver to our customers, whilst pushing shift left forward in the lifecycle.",
                "As a CRM QA Lead in the team, you will form a key part of a cross-functional product ream responsible for delivering a new cloud-based CRM platform. You will adopt QA practices that align with Agile principles and push the concern of testing as early in the development lifecycle as possible. You will own authoring and the execution of test plan, test cases and testing at every stage of the lifecycle. You will have a significant impact in the quality and delivery speed of our software, most importantly our customers. You will work closely with Implementation Partners, developers, product managers, and other QA in order to ensure the new CRM features we deliver to our customers have a high level of quality. In addition, you will also have the opportunity to propose improvements to our existing processes and automated tools in order to improve the team’s speed, quality and efficiency. ",
            ],
            "mandatorySkills": [
                "Defining the enterprise test strategy for the cloud-based CRM platform that aligns with the Agile/DevOps culture",
                "Lead all QA activities within the CRM delivery teams to ensure the concern of quality is understood by all team members",
                "Collaboratively work with Implementation Partner and internal delivery team to define, develop and deliver test automation solutions for the CRM platform",
                "Being an advocate for quality and encouraging developers at all levels to write high quality, testable software.",
                "Helping on our journey to CI/CD",
                " Liaising with business stakeholders supporting end-user activity, such as user acceptance testing",
                "Review design artefacts for testability and define overall testing plans",
                "Ambassador for TDD, BDD and ATDD models",
                "Evaluating and integrate open source and in house developed toolsets.",
                "Line-manage QA Engineers, coaching them to develop their skills and behaviours and develop their careers. Sharing testing knowledge and providing guidance and support.",
            ],
            "technicalSkill":[
                "Extensive testing experience of cloud-based CRM platforms preferably Salesforce",
                "Experience working on large-scale CRM migration projects",
                "Practical knowledge of test automation tools/frameworks for CRM platforms preferably Provar",
                " Practical knowledge of non-functional testing types such as accessibility, performance and security testing for CRM platforms",
                "Skilled in the design of acceptance tests.",
                "Line management and career coaching experience",
                "Passion for exploratory testing.",
            ],
            "additionalInfo": [
                "Support to learn and time to work on your personal objectives (access to Pluralsight)",
                "Platform to develop your testing knowledge within our QA Community"
            ],
            "desiredSkills": [
                "Exceptional attention to detail required",
                "An enthusiasm for new technologies with the ability to adapt and learn Has the confidence and initiative to evolve ideas and bring together pieces of work to produce changes",
                "Interest in all things testing, e.g. attended a recent conference/meetup, written a testing blog or shared your opinion on twitter"
            ],
            "qualification": [
                "Educated to at least graduate level (e.g. Bachelor Of Engineering, B-Tech) or equivalent is essential."
            ],
            "salary": "",
            "expiredStatus": false
        },
        {
            "id": 1,
            "roleName": "Java Developer",
            "postedDate": "05/15/2020",
            "location": "London",
            "jobType": "Full Time",
            "jobDescription": [
                "Carrying out development in accordance with the agreed requirements and development standards",
                "Testing of products in accordance with the test strategy to ensure that they are fit for purpose",
                "Assisting the Team Leader in examining packages of work and giving realistic timescales for completion",
                "Completion of work allocated within agreed time, cost and quality criteria and providing progress reports on assigned work as required",
                "Management and control of problems and change within their area of responsibility as requested by the Team Leader, including negotiation with other teams as necessary",
                "Prompt escalation of problems, issues and risks as necessary",
                "Playing an active part in Process improvement, awareness of and compliance with all relevant quality processes and procedures, including completion of all the specified quality records in order to be successful the candidate will be familiar with FMSD strategy and will work to achieve those business objectives."
            ],
            "mandatorySkills": [
                "Successfully manage themselves during the project lifecycle.",
                "Identify and mitigate risks that would impact the failure of the overall project and success.",
                "Effectively engage with multiple stakeholders and vendors on a regular basis.",
                "Must have hands-on Coding experience",
                "Must have worked on 2-3 Java Spring implementations",
                "Good knowledge of Spring Boot, Spring Integration, Spring Data",
                "Excellent analysis skills",
                "Strong and clear communication and presentation skills",
                "Self-motivated and enthusiastic",
                "Knowledge of the Scala programming language and the Akka framework.",
                "Experience as an open-source contributor and/or speaker"
            ],
            "technicalSkill":[
                "Java 11",
                "Spring Boot",
                "MySQL",
                "Oracle /Mongo Database",
                "Linux",
                "SOAP",
                "Restful Web Services",
                "JMS (RabbitMQ & WebSphere)",
                "UI experience",
                "Batch/File Handling",
                "GIT",
                "WebSphere",
                "IBM DMS tool experience"
            ],
            "additionalInfo": [],
            "desiredSkills": [
                "Successful candidates would ideally also demonstrate: <br/>An understanding of Risk Management.",
                "Strong experience in scripting languages, particularly Python Ability to code test tooling in Java Understanding of, and experience in non-functional testing, particularly around performance testing of latency metrics."
            ],
            "qualification": [
                "Educated to at least graduate level (e.g. Bachelor Of Engineering, B-Tech) or equivalent is essential."
            ],
            "salary": "Salary: £33,000 to £35,000 per year",
            "expiredStatus": false
        },
        {
            "id": 2,
            "roleName": "Cyber Security Consultant",
            "postedDate": "12/16/2020",
            "location": "London",
            "jobType": "Full Time",
            "jobDescription": [
                "The candidate is expected to be able to implement security services independently to deploy security services / products in mega projects that involves many security products and also across different domains (server, storage, applications, network etc).In addition to carrying out implementation, is required to give technical advice’s, recommendations & presentations in order to convince customer to adopt / accept the proposed solution.",
                "In addition to carrying out implementation, is required to give technical advice’s, recommendations & presentations in order to convince customer to adopt / accept the proposed solution."    
            ],
            "mandatorySkills": [],
            "technicalSkill":[
                "CheckPoint firewalls",
                "Palo Alto firewallst",
                "Fortinet firewalls",
                "RSA 2FA solutions",
                "Symantec end-point",
                "McAfee end-point",
                "BeyondTrust privilege access management systems",
                "CyberArk privilege access management systems",
                "Waterfall data diode",
                "QRadar logger / SIEM",
                "Carbon Black end-point",
                "Imperva database firewall",
                "Guardium database firewal",
                "Rapid7 vulnerability management software",
                "Nessus Tenables vulnerability management software"
            ],
            "additionalInfo": [
                "Implementation – can be either new installations or migration from existing system to new system.",
                "Candidate has to validate / evaluate that the solution that was sold to customer and call out discrepancies (if any). Ideally, this candidate should also persuade, sway & influence the customer to accept the new solution.",
                "Often time expected to work with diverse teams (in a matrix project organisation) – server, network & applications teams.",
                "Although this is not a shift job, but when there is a deadline or migration, the candidate needs to work longer hrs. He can claim his time-off eventually.",
                "Working environment varies (in different data centre and in customer’s offices) as per project needs."
            ],
            "desiredSkills": [],
            "qualification": [
                "Educated to at least graduate level (e.g. Bachelor Of Engineering, B-Tech) or equivalent is essential."
            ],
            "salary": "Salary: £27520 per year",
            "expiredStatus": true
        }
    ],
    "location":[
        "London"
    ],
    "jobType":[
        "Full Time",
        "Part Time",
        "Contract"
    ]
}
